<template>
    <div >
      <h1 class="select-1">MOT事件AI助手服务实例 </h1>
      <div class="centered"> 
      <el-select v-model="selectedOption" class="select-box"> 
        <el-option
          v-for="(option, index) in options"
          :key="index"
          :value="option"
          :label="option"
        ></el-option>
      </el-select>
      </div>
  
      <!-- 根据选中的选项显示相应的内容 -->
      <div class="content" v-if="selectedOption === options[0]">
        <el-card class="shadow" v-for="(section, index) in sections" :key="index">
          <div class="section-header">
            <h3>{{ section.title }}</h3>
            <img src="../../assets/点赞.png" alt="" class="dianzan" @click="handleLikeClick">
            <img src="../../assets/踩.png" alt="" class="dianzan" @click="handleLikeClick">
          </div>
          <div v-html="section.content.replace(/\n/g, '<br>')"
            style="padding: 10px; border: 1px solid #ccc; background-color: #f5f5f5; border-radius: 5px; box-shadow: 2px 2px 5px rgba(0, 0, 0, 0.2);"></div>
        </el-card>
      </div>
      
      <div class="content" v-if="selectedOption === options[1]">
        <el-card class="shadow" v-for="(section, index) in sections1" :key="index">
          <div class="section-header">
            <h3>{{ section.title }}</h3>
            <img src="../../assets/点赞.png" alt="" class="dianzan" @click="handleLikeClick">
            <img src="../../assets/踩.png" alt="" class="dianzan" @click="handleLikeClick">
          </div>
          <div v-html="section.content.replace(/\n/g, '<br>')"
            style="padding: 10px; border: 1px solid #ccc; background-color: #f5f5f5; border-radius: 5px; box-shadow: 2px 2px 5px rgba(0, 0, 0, 0.2);"></div>
        </el-card>
      </div>

      <div class="content" v-if="selectedOption === options[2]">
        <el-card class="shadow" v-for="(section, index) in sections2" :key="index">
          <div class="section-header">
            <h3>{{ section.title }}</h3>
            <img src="../../assets/点赞.png" alt="" class="dianzan" @click="handleLikeClick">
            <img src="../../assets/踩.png" alt="" class="dianzan" @click="handleLikeClick">
          </div>
          <div v-html="section.content.replace(/\n/g, '<br>')"
            style="padding: 10px; border: 1px solid #ccc; background-color: #f5f5f5; border-radius: 5px; box-shadow: 2px 2px 5px rgba(0, 0, 0, 0.2);"></div>
        </el-card>
      </div>

      <div class="content" v-if="selectedOption === options[3]">
        <el-card class="shadow" v-for="(section, index) in sections3" :key="index">
          <div class="section-header">
            <h3>{{ section.title }}</h3>
            <img src="../../assets/点赞.png" alt="" class="dianzan" @click="handleLikeClick">
            <img src="../../assets/踩.png" alt="" class="dianzan" @click="handleLikeClick">
          </div>
          <div v-html="section.content.replace(/\n/g, '<br>')"
            style="padding: 10px; border: 1px solid #ccc; background-color: #f5f5f5; border-radius: 5px; box-shadow: 2px 2px 5px rgba(0, 0, 0, 0.2);"></div>
        </el-card>
      </div>

      <div class="content" v-if="selectedOption === options[4]">
        <el-card class="shadow" v-for="(section, index) in sections4" :key="index">
          <div class="section-header">
            <h3>{{ section.title }}</h3>
            <img src="../../assets/点赞.png" alt="" class="dianzan" @click="handleLikeClick">
            <img src="../../assets/踩.png" alt="" class="dianzan" @click="handleLikeClick">
          </div>
          <div v-html="section.content.replace(/\n/g, '<br>')"
            style="padding: 10px; border: 1px solid #ccc; background-color: #f5f5f5; border-radius: 5px; box-shadow: 2px 2px 5px rgba(0, 0, 0, 0.2);"></div>
        </el-card>
      </div>
    </div>
    
  </template>
  <script src="./iconfont.js"></script>
  <script>
  export default {
    
    data() {
      return {
        options: [
          '编号:9 ,事件:融资融券客户的首次信用交易',
          '编号:10 ,事件:最近一次交易离当前的时间过长',
          '编号:22 ,事件:大额资金转入转出',
          '编号:24 ,事件:大额闲置资金客户提醒',
          '编号:106 ,事件:维持担保比例130%平仓提示'
        ],
        selectedOption: '',
        sections: [
          {
            title: '推荐沟通话术',
            content:
            '您好 张先生 先生/女士，我是您申万的客户经理 小李 ，您开通两融账户后，在交易中有没有遇到什么问题，有什么可以帮助到您的吗?'
          },
          {
            title: '个股分析',
            content:
            "'湘潭电化'所在行业：电力设备（申万一级），电池（申万二级）。当前市值：77亿元，市盈率：19.4，市净率：3.1。" +
            "股票近一月收益率：7.0%（申万二级：0.2%，较申万二级超额：6.8%）；股票近三月收益率：5.3%（申万二级：-2.8%，" +
            "较申万二级超额：8.1%）；股票近半年收益率：-22.2%（申万二级：-17.7%，较申万二级超额：-4.4%）；" +
            "股票近一年收益率：-30.4%（申万二级：-33.8%，较申万二级超额：3.4%）."
          },
          {
            title: '重仓行业分析',
            content:
            "股票所在申万二级行业为：电池，该行业近一月收益率：0.2%（大盘：2.3%，超额：-2.1%）；近三月收益" +
            "率：-2.8%（大盘：-1.3%，超额：-1.6%）；近半年收益率：-17.7%（大盘：-1.3%，超额：-16.4%）；近一年收益率：-3" +
            +"3.8%（大盘：-4.9%，超额：-28.9%）。"
          },
          {
            title: '当前市场分析',
            content:
                "【1】、首先，国内政策预期和中美关系预期主导行情运行。当前经济形势基本延续了四月以来的缓慢回落态势。而央行择机" +
                "陆续调降了银行间回购利率、MLF利率和LPR利率，但目前的政策力度能否重新加大经济复苏的力度，市场仍存在分歧。与此" +
                "同时，中美的外交和商业往来也出现了边际改善迹象，当然外部环境仍复杂多变，从而对市场行情产生较大的不确定性。<br>" +
                "【2】、其次，周五市场继续调整，盘中反弹受短期均线压制。 周五市场延续了周三以来的调整趋 势，沪指盘中反弹被十天" +
                "均线压制，目前运行在均线系统下方。当天市场热点主要集中在 农业和上游资源品。投资风格方面，市场基本是一个普跌的格局。<br>" +
                "【3】、最后，从运行节奏看， 沪指围绕年线来回拉锯，等待方向明朗。 五月下旬以来，沪指围绕 着年线来回拉锯，上有阻" +
                "力，下有支撑，暂时没有明确方向。短期连续反弹后，周三开始 重新进入调整，关注前期低点附近的支撑。<br>" +
                "【4】、风险提示：全球流动性紧缩超预期;国际地缘冲突超出预期；上市公司业绩增速回落超预期；"
          },
          {
            title: '个股分析',
            content:
            "2023年6月和Q2经济数据表现分化。一方面 6 月的生产、消费和投资均超预期，工业增加值和社零消费环比表现均超季节性；但另" +
            "一方面二季度 GDP 增速仅为 6.3%，对应两年平均增速仅为 3.3%， 季调环比增速仅为 0.8%，有数据以来环比表现仅高于 2022 " +
            "年同期，明显弱于季节性。纵观二季度经济走势，4-5月表现明显偏弱，6月降息落地、信贷向好，主要经济指标也有明显的边际改善。"
          }
        ],
        sections1: [
          {
            title: '推荐沟通话术',
            content:
              "您好 张先生 先生/女士，我是您申万的客户经理 小李 ，好久没和您联系了，给您打电话是想了解下您近期在投资方" +
              "面是否有什么问题？能否为您提供一些帮助？"
          },
          {
            title: '宏观经济分析',
            content:
            "2023年6月和Q2经济数据表现分化。一方面 6 月的生产、消费和投资均超预期，工业增加值和社零消费环比表现均超季节" +
            "性；但另一方面二季度 GDP 增速仅为 6.3%，对应两年平均增速仅为 3.3%， 季调环比增速仅为 0.8%，有数据以来环比" +
            "表现仅高于 2022 年同期，明显弱于季节性。纵观二季度经济走势，4-5月表现明显偏弱，6月降息落地、信贷向好，主要" +
            "经济指标也有明显的边际改善。"
          },
          {
            title: '当前市场分析',
            content:
            "【1】、首先，国内政策预期和中美关系预期主导行情运行。当前经济形势基本延续了四月以来的缓慢回落态势。而央行择" +
            "机陆续调降了银行间回购利率、MLF利率和LPR利率，但目前的政策力度能否重新加大经济复苏的力度，市场仍存在分歧。" +
            "与此同时，中美的外交和商业往来也出现了边际改善迹象，当然外部环境仍复杂多变，从而对市场行情产生较大的不确定性。<br>" +
            "【2】、其次，周五市场继续调整，盘中反弹受短期均线压制。 周五市场延续了周三以来的调整趋 势，沪指盘中反弹被十" +
            "天均线压制，目前运行在均线系统下方。当天市场热点主要集中在 农业和上游资源品。投资风格方面，市场基本是一个普" +
            "跌的格局。<br>" +
            "【3】、最后，从运行节奏看， 沪指围绕年线来回拉锯，等待方向明朗。 五月下旬以来，沪指围绕 着年线来回拉锯，上" +
            "有阻力，下有支撑，暂时没有明确方向。短期连续反弹后，周三开始 重新进入调整，关注前期低点附近的支撑。<br>" +
            "【4】、风险提示：全球流动性紧缩超预期;国际地缘冲突超出预期；上市公司业绩增速回落超预期；"
          },
          {
            title: '热点行业板块分析',
            content:
            "1.房地产：板块表现方面，SW房地产指数下跌1.75%，沪深300指数上涨1.92%，相对收益为-3.67%，板块表现弱于大市，在" +
            "31个板块排名中排第31位。个股表现方面，SW房地产板块涨跌幅排名前5位的房地产个股分别为：津滨发展、*ST泛海、中迪" +
            "投资、沙河股份、*ST新联，上周涨跌幅排名后5位的房地产个股分别为财信发展、格力地产、万泽股份、金科股份、中南建设" +
            "。板块表现方面，物业管理板块个股平均上涨1.47%，沪深300指数上涨1.92%，相对收益为-0.44%，板块表现弱于大市。当前" +
            "主流AH房企23/24PE均值分别为6.5/5.7倍；物管23/24PE均值分别为14/11倍。<br>" +
            "2.汽车：本周（2023/7/10-2023/7/14）沪深 300 指数收报 3,899.10 点，全周上涨 1.92%。汽车行业指数收报 5,788.70" +
            " 点，全周下跌 0.36%，涨幅底于沪深 300 指数 2.28 个百分点。汽车行业周涨幅在申万宏源一级行业中位列第 25 位，较" +
            "上周下降 24 位。<br>" +
            "3.交通运输：20230710-20230714交通运输行业指数下跌 0.46 %，跑输沪深 300 指数 2.38个百分点(上涨 1.92 %)。交运" +
            "三级子行业中，快递涨幅最大，为 3.85%，公路货运板块跌幅最大，为-4.12%。"
          },
          {
            title: '行业板块投资建议（市场热门板块）',
            content:
            "房地产：<br>" +
            "【1】、政治局会议政策态度转向，适时调整优化房地产政策，维持“看好”评级。我们认为，我国房地产需求端短期销售呈现" +
            "超跌、但中期需求仍有支撑，而供给端呈现供给主体过度出清、中期行业供给亟待修复，预计供需两端政策仍将更加积极支持" +
            "，尤其考虑多项宏观数据和地产数据的走弱，房地产行业政策有望进一步迎来优化；并预计市场中核心城市的销售也将逐步改" +
            "善，并格局优化下优质房企成长空间打开，将受益于政策放松和格局优化双重利好。 <br>【2】、我们维持房地产板块“看好”评级" +
            "，推荐：A股：华发股份、招商蛇口、滨江集团、保利发展、建发股份、金地集团、新城控股、万科A；H股：越秀地产、华润" +
            "置地、建发国际、中海外发展、龙湖集团；维持物业管理板块“看好”评级，推荐：保利物业、中海物业、万物云、华润万象、" +
            "新大正、碧桂园服务，建议关注：招商积余。"
          },
          {
            title: '推荐产品',
            content:
            "产品编码：F016105；产品名称:申万菱信兴乐优选A；产品类型:公募-混合型"
          }
        ],
        sections2: [
          {
            title: '服务内容',
            content:
              "您好 张先生 先生/女士，我是您申万的客户经理 小李 ，系统提示您在近期有资金转入/转出，为了确保您账户的安全性，所以给您打个电话确认一下是否为您本人操作？"
          },
          {
            title: '宏观经济分析',
            content:
           "2023年6月和Q2经济数据表现分化。一方面 6 月的生产、消费和投资均超预期，工业增加值和社零消费环比表现均超季节性；但" +
           "另一方面二季度 GDP 增速仅为 6.3%，对应两年平均增速仅为 3.3%， 季调环比增速仅为 0.8%，有数据以来环比表现仅高于 2" +
           "022 年同期，明显弱于季节性。纵观二季度经济走势，4-5月表现明显偏弱，6月降息落地、信贷向好，主要经济指标也有明显的" +
           "边际改善。"
          },
          {
            title: '当前市场分析',
            content:
            "【1】、首先，国内政策预期和中美关系预期主导行情运行。当前经济形势基本延续了四月以来的缓慢回落态势。而央行择机陆" +
            "续调降了银行间回购利率、MLF利率和LPR利率，但目前的政策力度能否重新加大经济复苏的力度，市场仍存在分歧。与此同时" +
            "，中美的外交和商业往来也出现了边际改善迹象，当然外部环境仍复杂多变，从而对市场行情产生较大的不确定性。<br>【2】" +
            "、其次，周五市场继续调整，盘中反弹受短期均线压制。 周五市场延续了周三以来的调整趋 势，沪指盘中反弹被十天均线压制" +
            "，目前运行在均线系统下方。当天市场热点主要集中在 农业和上游资源品。投资风格方面，市场基本是一个普跌的格局。【3】" +
            "、最后，从运行节奏看， 沪指围绕年线来回拉锯，等待方向明朗。 五月下旬以来，沪指围绕 着年线来回拉锯，上有阻力，下" +
            "有支撑，暂时没有明确方向。短期连续反弹后，周三开始 重新进入调整，关注前期低点附近的支撑。<br>【4】、风险提示：全" +
            "球流动性紧缩超预期;国际地缘冲突超出预期；上市公司业绩增速回落超预期；"

          },
          {
            title: '热点行业板块分析',
            content:
            "1.房地产：板块表现方面，SW房地产指数下跌1.75%，沪深300指数上涨1.92%，相对收益为-3.67%，板块表现弱于大市，在" +
            "31个板块排名中排第31位。个股表现方面，SW房地产板块涨跌幅排名前5位的房地产个股分别为：津滨发展、*ST泛海、中迪" +
            "投资、沙河股份、*ST新联，上周涨跌幅排名后5位的房地产个股分别为财信发展、格力地产、万泽股份、金科股份、中南建设" +
            "。板块表现方面，物业管理板块个股平均上涨1.47%，沪深300指数上涨1.92%，相对收益为-0.44%，板块表现弱于大市。当前" +
            "主流AH房企23/24PE均值分别为6.5/5.7倍；物管23/24PE均值分别为14/11倍。<br>" +
            "2.汽车：本周（2023/7/10-2023/7/14）沪深 300 指数收报 3,899.10 点，全周上涨 1.92%。汽车行业指数收报 5,788.70" +
            " 点，全周下跌 0.36%，涨幅底于沪深 300 指数 2.28 个百分点。汽车行业周涨幅在申万宏源一级行业中位列第 25 位，较" +
            "上周下降 24 位。<br>" +
            "3.交通运输：20230710-20230714交通运输行业指数下跌 0.46 %，跑输沪深 300 指数 2.38个百分点(上涨 1.92 %)。交运" +
            "三级子行业中，快递涨幅最大，为 3.85%，公路货运板块跌幅最大，为-4.12%。"
          },
          {
            title: '行业板块投资建议（市场热门板块）',
            content:
            "房地产：<br>" +
            "【1】、政治局会议政策态度转向，适时调整优化房地产政策，维持“看好”评级。我们认为，我国房地产需求端短期销售呈现" +
            "超跌、但中期需求仍有支撑，而供给端呈现供给主体过度出清、中期行业供给亟待修复，预计供需两端政策仍将更加积极支持" +
            "，尤其考虑多项宏观数据和地产数据的走弱，房地产行业政策有望进一步迎来优化；并预计市场中核心城市的销售也将逐步改" +
            "善，并格局优化下优质房企成长空间打开，将受益于政策放松和格局优化双重利好。 <br>【2】、我们维持房地产板块“看好”评级" +
            "，推荐：A股：华发股份、招商蛇口、滨江集团、保利发展、建发股份、金地集团、新城控股、万科A；H股：越秀地产、华润" +
            "置地、建发国际、中海外发展、龙湖集团；维持物业管理板块“看好”评级，推荐：保利物业、中海物业、万物云、华润万象、" +
            "新大正、碧桂园服务，建议关注：招商积余。"
          },
          {
            title: '推荐产品',
            content:
            "产品编码：F016105；产品名称:申万菱信兴乐优选A；产品类型:公募-混合型"
          }
        ],
        sections3: [
          {
            title: '服务内容',
            content:
            "您好 张先生 先生/女士，我是您申万的客户经理 小李 ，系统提示您有一笔比较大的闲置资金，我可以为您提供一些帮助和" +
            "建议。首先，将这笔资金进行有效的投资，不仅可以增加您的财富，还能让您的资金更好地为您工作。我们可以为您提供专业" +
            "的投资建议和方案，帮助您实现最大化收益。如果您需要更加灵活的投资方式，可以考虑选择货币基金、短期理财产品等低风" +
            "险、高流动性的产品。这些产品可以帮助您保持资金的流动性，并且具有一定的收益性。最后，如果您有任何疑问或者需要了" +
            "解更多的信息，请随时联系我，我会尽力为您提供支持和建议。"
          },
          {
            title: '持仓分析',
            content:
            "客户当前总资产：3924305元。其中，股票市值1001936（比例：25.5%），场外产品（非现金）2071463（比例：52.8%），" +
            "现金及现金类产品850905（比例：21.7%）。客户近半年累计盈利：482122元，收益率：12.6%，其中股票收益：594867元，" +
            "收益率：48.4%，场内基金0元，收益率：0.0%，场外产品（非现金）-39921元，收益率：-2.2%，现金类产品0元，收益率：0.0%。"

          },
          {
            title: '客户投资偏好分析',
            content:
            "该客户投资行业偏好(申万一级):[国防军工], 当前持仓比例:37.4%,[机械设备], 当前持仓比例:0.0% 持仓风格偏好:[偏好" +
            "投资小盘股],[偏好投资价值股]<br>交易风格偏好:[偏好长线交易],[无明显投资趋势偏好]<br>交易风险偏好:[较低风险] "
          },
          {
            title: '宏观经济分析',
            content:
            "2023年6月和Q2经济数据表现分化。一方面 6 月的生产、消费和投资均超预期，工业增加值和社零消费环比表现均超季节性；" +
            "但另一方面二季度 GDP 增速仅为 6.3%，对应两年平均增速仅为 3.3%， 季调环比增速仅为 0.8%，有数据以来环比表现仅高于" +
            " 2022 年同期，明显弱于季节性。纵观二季度经济走势，4-5月表现明显偏弱，6月降息落地、信贷向好，主要经济指标也有明" +
            "显的边际改善。"
          },
          {
            title: '当前市场分析',
            content:
            "【1】、首先，国内政策预期和中美关系预期主导行情运行。当前经济形势基本延续了四月以来的缓慢回落态势。而央行择机陆" +
            "续调降了银行间回购利率、MLF利率和LPR利率，但目前的政策力度能否重新加大经济复苏的力度，市场仍存在分歧。与此同时" +
            "，中美的外交和商业往来也出现了边际改善迹象，当然外部环境仍复杂多变，从而对市场行情产生较大的不确定性。<br>【2】" +
            "、其次，周五市场继续调整，盘中反弹受短期均线压制。 周五市场延续了周三以来的调整趋 势，沪指盘中反弹被十天均线压" +
            "制，目前运行在均线系统下方。当天市场热点主要集中在 农业和上游资源品。投资风格方面，市场基本是一个普跌的格局。<br>" +
            "【3】、最后，从运行节奏看， 沪指围绕年线来回拉锯，等待方向明朗。 五月下旬以来，沪指围绕 着年线来回拉锯，上有阻力" +
            "，下有支撑，暂时没有明确方向。短期连续反弹后，周三开始 重新进入调整，关注前期低点附近的支撑。<br>【4】、风险提" +
            "示：全球流动性紧缩超预期;国际地缘冲突超出预期；上市公司业绩增速回落超预期；"
          },
          {
            title: '热点行业板块分析',
            content:
            "1.房地产：板块表现方面，SW房地产指数下跌1.75%，沪深300指数上涨1.92%，相对收益为-3.67%，板块表现弱于大市，在" +
            "31个板块排名中排第31位。个股表现方面，SW房地产板块涨跌幅排名前5位的房地产个股分别为：津滨发展、*ST泛海、中迪" +
            "投资、沙河股份、*ST新联，上周涨跌幅排名后5位的房地产个股分别为财信发展、格力地产、万泽股份、金科股份、中南建设" +
            "。板块表现方面，物业管理板块个股平均上涨1.47%，沪深300指数上涨1.92%，相对收益为-0.44%，板块表现弱于大市。当前" +
            "主流AH房企23/24PE均值分别为6.5/5.7倍；物管23/24PE均值分别为14/11倍。<br>" +
            "2.汽车：本周（2023/7/10-2023/7/14）沪深 300 指数收报 3,899.10 点，全周上涨 1.92%。汽车行业指数收报 5,788.70" +
            " 点，全周下跌 0.36%，涨幅底于沪深 300 指数 2.28 个百分点。汽车行业周涨幅在申万宏源一级行业中位列第 25 位，较" +
            "上周下降 24 位。<br>" +
            "3.交通运输：20230710-20230714交通运输行业指数下跌 0.46 %，跑输沪深 300 指数 2.38个百分点(上涨 1.92 %)。交运" +
            "三级子行业中，快递涨幅最大，为 3.85%，公路货运板块跌幅最大，为-4.12%。"
          },
          {
            title: '行业板块投资建议',
            content:
            "国防军工：“三大主线”把握2023年国防军工行业投资机会。<br>  一、主机主线：<br>    1）航发产业链：装备放量叠加国" +
            "产替代加速；<br>    2）主机厂：未来有望接力进入高速增长阶段。<br>  二、成长主线：<br>    1）精确制导武器：装" +
            "备放量带动卫导+惯导+T/R组件高增；<br>    2）低轨卫星：星座建设加快，应用领域拓展；<br>    3）无人机：国内军用" +
            "及国际外贸需求旺盛；<br>    4）海底观测：海上防卫核心，海洋强国建设加速。<br>  三、价值主线：<br>    1）高端" +
            "材料：高温铸造合金、隐身材料等，渗透率提升及国产替代加速；<br>    2）电子元器件：估值重构完成，基本面有望迎来拐" +
            "点。重点关注标的：主机组合（中航沈飞、中航西飞、航发动力、航发控制、航发科技）+成长组合（盟升电子、佳缘科技、长" +
            "盈通、航宇科技）+价值组合（中航光电、振华科技、图南股份、中航重机、西部超导、三角防务、中科星图）"

          },
          {
            title: '推荐产品',
            content:
            "产品编码：F970026；产品名称:申万宏源灵通快利短债；产品类型:公募-债券型"
          }
        ],
        sections4: [
          {
            title: '推荐沟通话术',
            content:
            "您好 张先生 先生/女士，我是您申万的客户经理 小李 ，您的信用账户维持担保比例于 2023-07-21 （T-1日）收市低于我公" +
            "司平仓线130%，请您于 2023-07-21 （T日）闭市前交易时间内，采取补充担保物或了结信用账户内负债的措施，使收市后维持" +
            "担保比例达到我公司警戒线以上。如在上述期限内未达到，我公司将于 2023-07-21 （T+1日）按《融资融券业务合同》的约定" +
            "对您的账户资产实施强制平仓。"
          },
        ]
      };
    },
    methods: {
      handleLikeClick() {
      // 处理点赞点击事件的逻辑
      console.log('点赞被点击');
    },
    },
  };
  </script>
  
  <style scoped>
  /**.el-card.shadow {
    box-shadow: 0 2px 4px rgba(0, 0, 0, 0.1);
    margin-bottom: 1px;
    padding: 5px;
  }*/
  
  .el-card h3 {
    margin-bottom: 10px;
    font-size: 18px;
  }
  
  .el-card p {
    margin-bottom: 10px;
    line-height: 1.5;
    color: #333;
  }
  .centered {
    text-align: center;
  }
  .select-1{
    text-align: center;
  }
  .select-box{
    width: 400px;
    margin-bottom:50px;
  }
  .dianzan{
    width: 20px;
    height: 20px;
  }
  .section-header {
    display: flex;
    align-items: center;
    margin-bottom: 10px;
  }
  
  .section-header h3 {
    margin-right: 10px;
    font-size: 18px;
  }
  
  .section-header img {
    width: 20px; /* Adjust the width as needed */
    height: 20px; /* Adjust the height as needed */
    margin-right: 5px;
    cursor: pointer; /* 添加指针样式以指示可点击 */
  }
  </style>
  